{
  "Metadata": {
    "siteName": "FoxSay",
    "defaultTitle": "FoxSay | Портфолио",
    "defaultDescription": "Я Software Engineer. Создаю веб-приложения на React, Next.js, TypeScript. Также разрабатываю на Node.js, Python и Go.",
    "home": {
      "title": "FoxSay | Главная"
    },
    "about": {
      "title": "FoxSay | Обо мне"
    }
  },
  "Header": {
    "Navbar": {
      "home": "Главная",
      "about": "Обо мне",
      "experience": "Опыт",
      "projects": "Проекты",
      "contact": "Контакты",
      "blog": "Блог"
    }
  },
  "HomePage": {
    "title": "Привет, я Дмитрий Чекашов!",
    "subtitle": "разработчик",
    "description": "Я разрабатываю красивые интерфейсы и производительные системы",
    "contactButton": "Связаться со мной",
    "projectsButton": "Смотреть проекты"
  },
  "AboutPage": {
    "title": "Обо мне",
    "description": "Привет, посетитель моего сайта-портфолио! Меня зовут Дмитрий Чекашов. Я инженер-программист с 10-летним опытом в веб-разработке.",
    "careerTitle": "Карьера",
    "careerDescriptionOne": "В 2016 году я увлекся программированием, когда перевелся с первого курса строительного колледжа на направление «Программирование в компьютерных системах». Параллельно с учебой начал карьеру верстальщика в местной веб-студии, а после выпуска и переезда в Москву перешел во frontend-разработку на React.",
    "careerDescriptionTwo": "Проработав несколько лет с интерфейсами, я открыл для себя backend. Первые полгода изучал PHP и занимался интеграциями, но затем переключился на Python. С тех пор около четырех лет разрабатываю на Django и FastAPI, создавая надежные серверные решения.",
    "careerDescriptionThree": "Сейчас мне нравится решать задачи любой сложности, связанные с вебом: от сложных интерфейсов до распределенных систем и обвязки ML-моделей. Мой путь через разные слои разработки позволяет видеть проект целиком и выбирать лучшие инструменты для каждой задачи.",
    "hobbiesTitle": "Увлечения",
    "hobbiesDescriptionOne": "В свободное время я хожу в тренажерный зал, читаю техническую литературу, пишу свои проекты. Также люблю классическую литературу — мой любимый автор Фридрих Мария Ремарк. Изучаю иностранные языки: английский (B2) и немецкий (A2). Увлекаюсь документальными фильмами и фильмами о выдающихся людях. Мои самые любимые фильмы: «Оппенгеймер» и «Человек, который познал бесконечность»."
  },
  "Footer": {
    "allRightsReserved": "Все права защищены"
  }
}
